<template>
  <div class="musicList">
    <div class="musicTop">
      <div class="title">发现好歌单</div>
      <div class="more">查看更多</div>
    </div>
    <div class="musicContent">
      <van-swipe
        :loop="false"
        :width="150"
        class="my-swpie"
        :show-indicators="false"
      >
        <van-swipe-item v-for="item in state.musicList" :key="item">
        <router-link :to="{path:'/itemMusic',query:{id:item.id}}">
          <img :src="item.picUrl" alt="" />
          <span class="playCount">
            <svg
              t="1657525124985"
              class="icon"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="1123"
              width="200"
              height="200"
            >
              <path
                d="M507.5968 103.66976c186.14272 0 337.38752 148.2752 340.39808 332.32896l0.0512 6.7584A66.58048 66.58048 0 0 1 890.88 504.96512V629.76a66.56 66.56 0 0 1-66.56 66.56h-10.24a66.56 66.56 0 0 1-66.56-66.56V504.96512c0-28.14976 17.47968-52.224 42.16832-61.952h-3.54304v-1.4336c0-152.6784-124.71296-276.48-278.54848-276.48-152.29952 0-276.04992 121.33376-278.50752 271.91296l-0.03072 4.18816A66.59072 66.59072 0 0 1 276.48 504.96512V629.76a66.56 66.56 0 0 1-66.56 66.56h-10.24a66.56 66.56 0 0 1-66.56-66.56V504.96512a66.59072 66.59072 0 0 1 46.1824-63.3856h-12.15488c0-186.624 152.4224-337.92 340.44928-337.92z"
                fill="#FAB005"
                p-id="1124"
              ></path>
              <path
                d="M633.7536 374.3744c6.76864 44.38016-17.17248 80.85504-67.86048 109.30176l-2.9184 1.60768v113.3056l1.19808 0.26624c4.06528 0.99328 8.05888 2.2016 11.9808 3.69664l3.92192 1.5872c18.37056 7.95648 32.24576 21.22752 38.37952 40.59136l0.5632 1.95584 0.17408 0.4608c3.7888 11.4688 4.13696 32.34816-0.36864 49.3568l-0.7168 2.51904c-7.7312 25.6512-25.98912 43.63264-54.1184 49.52064l-1.024 0.18432 0.01024 93.2352c0 3.05152-0.65536 5.95968-1.8432 8.56064-3.29728 30.75072-37.35552 59.83232-83.3536 68.54656-52.74624 10.00448-101.23264-10.56768-108.27776-45.9264-7.04512-35.36896 30.0032-72.15104 82.74944-82.15552 25.86624-4.89472 50.70848-2.4576 70.144 5.48864v-45.03552l-1.52576-0.08192a163.06176 163.06176 0 0 1-37.6832-7.00416l-2.79552-0.9216c-42.2912-14.52032-74.51648-46.77632-89.11872-99.38944a24.22784 24.22784 0 0 1-0.80896-4.4032l-0.06144-0.96256-0.36864-3.42016-0.21504-2.2016c-2.31424-25.4976-0.69632-52.9408 8.0384-79.7184 16.2816-49.92 53.8624-83.48672 115.02592-91.1872l4.62848-0.54272 2.82624-1.16736 2.048-0.89088 0.02048-128.26624a20.48 20.48 0 0 1 13.33248-19.24096l1.52576-0.49152c52.59264-14.7456 88.18688 8.41728 96.49152 62.8224zM522.3936 502.30272l-1.792 0.17408c-46.78656 5.07904-72.45824 27.65824-84.20352 63.67232-6.71744 20.5824-8.01792 42.78272-6.17472 63.1808l0.54272 5.13024 0.63488 2.1504c10.83392 35.6864 31.5392 56.66816 59.25888 67.04128l2.79552 1.00352c8.12032 2.78528 16.44544 4.53632 24.56576 5.39648l4.37248 0.36864v-71.0656l-0.88064 0.32768c-8.40704 3.30752-13.75232 9.17504-16.98816 17.8688l-0.6144 1.77152a20.24448 20.24448 0 0 1-25.61024 13.06624 20.52096 20.52096 0 0 1-12.94336-25.856c8.81664-27.07456 28.32384-43.68384 55.95136-49.11104l1.08544-0.2048v-94.9248z m40.58112 139.0592v64.9728l0.24576-0.1024c7.95648-3.38944 12.71808-9.27744 15.53408-17.46944l0.53248-1.66912c1.80224-5.95968 2.48832-12.8 2.2016-19.51744a60.53888 60.53888 0 0 0-0.44032-5.26336l-0.36864-2.2528-1.0752-3.44064c-2.34496-6.61504-7.45472-11.32544-15.53408-14.82752l-1.09568-0.44032z m0.99328-293.3248l-0.99328 0.08192v89.30304l2.07872-1.51552c21.99552-16.4864 31.0272-34.26304 28.85632-53.38112l-0.256-1.91488c-3.65568-23.9616-11.8272-33.6896-29.68576-32.5632z"
                fill="#FAB005"
                p-id="1125"
              ></path>
            </svg>
            {{ changeCount(item.playCount) }}
          </span>
          <span class="name">{{ item.name }}</span>
          </router-link>
        </van-swipe-item>
      </van-swipe>
    </div>
  </div>
</template>
<script>
import { getMusicList } from '@/request/api/home.js'
import { reactive } from '@vue/reactivity'
import { onMounted } from '@vue/runtime-core'
export default {
  /* data() {
    return {
      musicList: [],
    }
  },
  methods: {
    async getGnedan() {
      let res = await getMusicList()
      console.log(res)
      this.musicList = res.data.result
    },
    changeCount: function (num) {
      if (num >= 100000000) {
        return (num / 100000000).toFixed(1) + '亿'
      } else if (num >= 10000) {
        return (num / 10000).toFixed(1) + '万'
      }
    },
  },
  mounted() {
    this.getGnedan()
  }, */
  setup() {
    const state = reactive({
      musicList: [],
    })
   function changeCount(num) {
      if (num >= 100000000) {
        return (num / 100000000).toFixed(1) + '亿'
      } else if (num >= 10000) {
        return (num / 10000).toFixed(1) + '万'
      }
    }
    onMounted(async () => {
      let res = await getMusicList()
      console.log(res)
      state.musicList = res.data.result
    })
    return {state,changeCount}
  },
}
</script>

<style lang="less" scoped>
.musicList {
  width: 100%;
  height: 5rem;
  padding: 0.2rem;
  .musicTop {
    width: 100%;
    height: 0.6rem;
    display: flex;
    justify-content: space-between;
    margin-bottom: 0.2rem;
    .title {
      font-size: 0.4rem;
      font-weight: 900;
    }
    .more {
      border: 1px solid #ccc;
      text-align: center;
      line-height: 0.6rem;
      padding: 0 0.2rem;
      border-radius: 0.4rem;
    }
  }
  .musicContent {
    width: 100%;
    height: 4rem;
    .my-swpie {
      height: 100%;
      img {
        width: 100%;
        height: 2rem;
      }
    }
  }
}
</style>
